tutorials/incompressible/pUCoupledFoam/backwardFacingStepLaminar/Allrun
#!/bin/bash

# Klas Jareteg, 2012-10-13
# Description:
#   Script to run comparative case between coupled and segregated solvers.


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=pUCoupledFoam

runApplication blockMesh
runApplication potentialFoam
runApplication $application

